{
  "info": {
    "name": "Carga de Personajes",
    "schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
  },
  "item": [
    {
      "name": "Shulk, el Portador de la Monado",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Shulk, el Portador de la Monado\", \"descripcion\": \"Shulk es un joven investigador del mundo de Bionis que se ve arrastrado a la guerra tras descubrir el poder de la espada Monado. Esta arma le otorga visiones del futuro, pero también una gran responsabilidad.\\n\\nAl principio inseguro, Shulk madura rápidamente mientras enfrenta enemigos formidables y secretos que sacuden su fe en la realidad. Su viaje es tanto físico como filosófico.\\n\\nGuiado por su deseo de proteger a los suyos y comprender el futuro, Shulk se convierte en un héroe marcado por la visión y la empatía.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Gwyn, el Señor de la Ceniza",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Gwyn, el Señor de la Ceniza\", \"descripcion\": \"Gwyn fue el Señor de la Luz Solar y uno de los principales dioses en Dark Souls. Al encender la Primera Llama, sacrificó su alma para retrasar la era de la oscuridad, iniciando un ciclo interminable de fuego y decadencia.\\n\\nAlguna vez majestuoso, Gwyn acabó convertido en un ser vacío, sin mente ni gloria. Su reino colapsó, y sus actos, aunque heroicos, trajeron consecuencias catastróficas para el mundo.\\n\\nGwyn es símbolo del sacrificio mal entendido: un rey que, por miedo al cambio, lo condenó todo a repetirse eternamente.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Noah, el Heraldo del Fin",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Noah, el Heraldo del Fin\", \"descripcion\": \"Noah es un 'off-seer' en Xenoblade Chronicles 3, encargado de despedir las almas de los caídos en una guerra eterna entre dos naciones. Su mirada melancólica es la de alguien que ha visto demasiada muerte.\\n\\nPese a su deber sombrío, Noah mantiene una esperanza inquebrantable. Su viaje lo lleva a desafiar el ciclo de guerra, a comprender el tiempo y la identidad, y a proteger a quienes ama.\\n\\nCon su flauta, despide a los muertos, pero su verdadera melodía es la del cambio. Noah es un símbolo de redención.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Solid Snake, el Soldado de Sombras",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Solid Snake, el Soldado de Sombras\", \"descripcion\": \"Solid Snake es un legendario soldado y espía, entrenado desde joven para infiltrarse, sobrevivir y eliminar amenazas globales. Creado como clon de Big Boss, su vida ha sido una lucha constante contra su propio origen.\\n\\nSnake es pragmático, cínico, pero profundamente humano. Cuestiona la guerra, la obediencia y su lugar en un mundo donde la tecnología y la política corrompen incluso las mejores intenciones.\\n\\nSu legado no es solo el de un soldado perfecto, sino el de un hombre que nunca dejó de luchar por la verdad.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Legion, el Enmascarado Sin Rostro",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Legion, el Enmascarado Sin Rostro\", \"descripcion\": \"Legion es un misterioso asesino de Fire Emblem: New Mystery of the Emblem, conocido por su máscara siniestra y su manera infantil de hablar. Él no actúa como un individuo, sino como parte de un colectivo de copias idénticas, eliminando cualquier rastro de identidad propia.\\n\\nSirviendo a fuerzas oscuras, Legion y sus réplicas fueron utilizados como armas vivientes, cumpliendo órdenes sin cuestionarlas. Para Legion, el concepto de 'yo' no existe; todo lo que hace es por 'nosotros', reflejando una profunda pérdida de humanidad.\\n\\nA pesar de su brutalidad, Legion muestra atisbos de inocencia, como un niño que no comprende del todo la crueldad de sus acciones. Este contraste entre su naturaleza violenta y su pureza corrompida lo convierte en un personaje trágico.\\n\\nAl final, Legion es derrotado, dejando tras de sí una tristeza silenciosa. Su historia es un recordatorio inquietante de cómo la manipulación y la deshumanización pueden destruir incluso a las almas más puras.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Samus Aran, la Cazadora Silenciosa",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Samus Aran, la Cazadora Silenciosa\", \"descripcion\": \"Samus Aran es una cazarrecompensas intergaláctica, famosa por su armadura avanzada y su lucha constante contra los Piratas Espaciales y los metroides. Criada por los Chozo, combina entrenamiento militar con tecnología alienígena.\\n\\nA pesar de su fama, Samus es una figura solitaria. Su historia está marcada por traumas, decisiones difíciles y una carga que solo ella puede soportar.\\n\\nSu silencio no es debilidad, sino una armadura emocional. Samus es la encarnación de fuerza, resistencia y determinación.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Solaire of Astora, el Caballero del Sol",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Solaire of Astora, el Caballero del Sol\", \"descripcion\": \"Solaire of Astora es un caballero errante del mundo de Dark Souls, conocido por su devoción al sol y su icónica frase: '¡Praise the Sun!'. Su objetivo: encontrar su propio sol, una metáfora de sentido y propósito.\\n\\nAmable, cortés y de espíritu noble, Solaire ofrece ayuda desinteresada a los jugadores, incluso en los momentos más oscuros. Su fe inquebrantable es una rareza en un mundo decadente.\\n\\nSolaire representa la luz que persiste en la desesperación. Aunque su final es ambiguo, su espíritu brilla eterno.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Bramimond, el Eco de Todos",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Bramimond, el Eco de Todos\", \"descripcion\": \"Bramimond fue uno de los legendarios Ocho Héroes de Elibe, quien selló al dragón oscuro durante la Antigua Guerra. Para dominar la magia prohibida conocida como 'Érebo', Bramimond sacrificó su identidad, dejando atrás su voz, rostro y voluntad propia.\\n\\nAl perder su individualidad, Bramimond adoptó las palabras, rostros y emociones de quienes le hablaban. Ya no era una sola persona, sino un reflejo de todos los seres humanos que encontraba, tanto en voz como en expresión.\\n\\nViviendo en reclusión dentro del Santuario de Érebo, Bramimond veló por el equilibrio entre la luz y la oscuridad, interviniendo solo cuando el mundo se encontraba al borde del colapso. Su existencia era una paradoja: un guardián de la humanidad que había renunciado a ser humano.\\n\\nA pesar de su aislamiento, Bramimond actuó cuando fue necesario, guiando a nuevos héroes para enfrentar amenazas que surgían de las sombras. Aunque su figura se desdibujó con el tiempo, su legado persiste como símbolo del sacrificio total por un bien mayor.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Bayonetta, la Bruja Umbra",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Bayonetta, la Bruja Umbra\", \"descripcion\": \"Bayonetta es una poderosa bruja que combate ángeles y demonios con estilo, gracia y un sentido del humor afilado. Armada con pistolas y hechizos, sus batallas son tan coreográficas como letales.\\n\\nAunque su pasado está envuelto en misterio, Bayonetta busca piezas de su historia perdida mientras enfrenta amenazas cósmicas. Su confianza desbordante esconde un corazón leal y una voluntad indomable.\\n\\nNo es solo una guerrera, sino una fuerza de la naturaleza: sensual, sarcástica y absolutamente imparable.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Slave Knight Gael, el Último Peregrino",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Slave Knight Gael, el Último Peregrino\", \"descripcion\": \"Slave Knight Gael fue un caballero al servicio de los dioses, condenado a vagar como esclavo en busca de la salvación de la humanidad. En su desesperada misión, buscaba la sangre de la humanidad pura para crear un nuevo mundo a partir de las cenizas del viejo.\\n\\nA lo largo de los siglos, Gael cruzó tierras devastadas y enfrentó horrores innombrables, soportando una corrupción lenta que desgastaba su cuerpo y su mente. Su voluntad, sin embargo, jamás flaqueó, impulsada por su juramento eterno.\\n\\nAl final de su viaje, en las ruinas del mundo moribundo, Gael sucumbió a la locura, transformándose en una bestia consumida por el deseo de completar su propósito. Incluso en su caída, continuó luchando con una furia imparable.\\n\\nSu historia es la de un caballero que, en su devoción absoluta, sacrificó todo: su humanidad, su cordura y su vida, para entregar al mundo la última chispa de esperanza a través de su sangre.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Edelgard, la Rosa Carmesí",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Edelgard, la Rosa Carmesí\", \"descripcion\": \"Edelgard von Hresvelg es la emperatriz del Sacro Imperio de Adrestia y líder de las Águilas Negras. En Fire Emblem: Three Houses, encarna la revolución contra la corrupción eclesiástica y la nobleza.\\n\\nMarcada por un pasado cruel y experimentos forzados, Edelgard lucha por romper el sistema que perpetúa el sufrimiento. Su visión es radical: destruir el orden actual para crear un mundo donde nadie sufra por su linaje.\\n\\nEdelgard es una figura compleja: idealista, pero dispuesta a ensuciarse las manos por el bien mayor.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Ryuji Sakamoto, el Rebelde del Corazón",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Ryuji Sakamoto, el Rebelde del Corazón\", \"descripcion\": \"Ryuji es uno de los primeros aliados del protagonista en Persona 5 y miembro fundador de los Phantom Thieves. Impulsivo, ruidoso y con un fuerte sentido de justicia, Ryuji carga con la etiqueta de 'problemático' desde que se enfrentó a la autoridad corrupta de su escuela.\\n\\nAntiguo atleta, Ryuji vio su carrera arruinada por el abuso físico de un profesor, lo que encendió su desconfianza hacia los adultos y su deseo de desafiar un sistema injusto. Su despertar como Persona representa esa ira canalizada en una lucha por liberar a los oprimidos.\\n\\nAunque a veces actúa sin pensar, Ryuji es leal, valiente y profundamente comprometido con sus amigos. Detrás de su actitud rebelde hay un joven que solo quiere hacer lo correcto, incluso si eso significa enfrentarse al mundo entero.\\n\\nSu viaje como Phantom Thief no solo lo lleva a desafiar la corrupción, sino también a redescubrir su valor propio. Ryuji demuestra que el corazón de un verdadero héroe puede latir con rabia… pero también con compasión.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Rex, el Portador de la Espada Viviente",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Rex, el Portador de la Espada Viviente\", \"descripcion\": \"Rex es un joven buzo de Xenoblade Chronicles 2 que sueña con llegar al Elíseo, un paraíso perdido. Su vida cambia cuando se une a Pyra, una Blade legendaria que alberga un gran poder.\\n\\nInocente pero determinado, Rex guía un grupo de aliados a través de conflictos políticos y batallas épicas. Su optimismo y compasión lo convierten en un líder nato.\\n\\nRex demuestra que no se necesita grandeza de nacimiento para marcar la diferencia, solo un corazón dispuesto a creer y luchar por los demás.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "Ayra, la Espada Relámpago de Isaach",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"Ayra, la Espada Relámpago de Isaach\", \"descripcion\": \"Ayra fue una princesa del reino de Isaach, conocida por su inigualable destreza con la espada y su férrea voluntad. Aunque nacida en la realeza, fue criada como guerrera, dedicando su vida a proteger a su familia y a su pueblo.\\n\\nTras la invasión de Grannvale a Isaach, Ayra se vio obligada a huir y cuidar de su joven sobrino Shannan, convirtiéndose en su protectora. A pesar de la guerra y la traición que la rodeaban, Ayra se mantuvo firme en sus principios de honor y justicia.\\n\\nSu habilidad en combate era temida en el campo de batalla, siendo célebre por su velocidad y técnica letal. Ayra luchaba no por gloria, sino por amor a su patria y por el futuro de su gente.\\n\\nAunque su destino estuvo marcado por la tragedia, su espíritu indomable y su leyenda como la 'Espada Relámpago' sobrevivieron, inspirando a generaciones que soñaron con un Isaach libre.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    },
    {
      "name": "2B, el Eco de la Humanidad",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/json"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "{\"titulo\": \"2B, el Eco de la Humanidad\", \"descripcion\": \"2B es una androide de combate de YoRHa, diseñada para proteger a los humanos en una guerra interminable contra máquinas alienígenas. Con apariencia humana pero emociones reprimidas, su misión es clara: obedecer sin cuestionar.\\n\\nA lo largo de su viaje en NieR: Automata, 2B comienza a cuestionar la verdad detrás de la guerra, la existencia, y su rol en un ciclo eterno de muerte y resurrección. Sus interacciones con 9S revelan un alma atrapada entre el deber y el deseo de entender.\\n\\n2B encarna la tragedia de lo artificial que desea ser humano, enfrentando dilemas morales mientras combate en un mundo sin esperanza.\"}"
        },
        "url": {
          "raw": "http://localhost:8000/api/notes",
          "protocol": "http",
          "host": [
            "localhost"
          ],
          "port": "8000",
          "path": [
            "api",
            "personajes"
          ]
        }
      },
      "response": []
    }
  ]
}